# AnalysisDisplayColorSettings Properties

---
The AnalysisDisplayColorSettings type exposes the following members.
| Name| Description
---|---|---
| ColorSettingsType|  Stores type of color settings
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| MaxColor|  Color assigned to the maximum value.
| MinColor|  Color assigned to the minimum value.
Top
#### Reference
AnalysisDisplayColorSettings Class
Autodesk.Revit.DB.Analysis Namespace